meeting/agenda/2025/07-29.org
:PROPERTIES:
:ID:       4F7A0760-760C-4B76-B961-7E2DB4B3BCC2
:END:
#+title: QT4 CG Meeting 131 Agenda 2025-07-29
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

[[../][Agenda index]] / [[https://qt4cg.org][QT4CG.org]] / [[https://qt4cg.org/dashboard][Dashboard]] / [[https://github.com/qt4cg/qtspecs/issues][GH Issues]] / [[https://github.com/qt4cg/qtspecs/pulls][GH Pull Requests]]

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).

The [[https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09][Zoom meeting]] ID is 831 9996 6275; the passcode is 707664.

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for more details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2025/07-22.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for /12 August 2025/. The CG /will not/ meet on 5 August.
The following meeting is scheduled for 19 August 2025.

The CG will take a short recess in late August. We will *not* meet on 26 August,
2 September, or 9 September.

** Review of open action items [0/5]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal
+ [ ] QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available
+ [ ] QT4CG-118-01: MK to make an incorrect type raise an error in #1906
+ [ ] QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.
+ [ ] QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps

** Review of open pull requests and issues
:PROPERTIES:
:CUSTOM_ID: open-pull-requests
:END:

This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See [[#technical-agenda][Technical Agenda]] below for the focus of this
meeting.

*** Blocked
:PROPERTIES:
:CUSTOM_ID: blocked
:END:

The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.

+ PR [[https://qt4cg.org/dashboard/#pr-2124][#2124]]: 573 Functions to Construct Trees
+ PR [[https://qt4cg.org/dashboard/#pr-2063][#2063]]: 1996 Lookups, KeySpecifier: Literal, ContextValueRef
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array
+ PR [[https://qt4cg.org/dashboard/#pr-1062][#1062]]: 150bis revised proposal for fn:ranks

*** Merge without discussion
:PROPERTIES:
:CUSTOM_ID: merge-without-discussion
:END:

The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.

+ PR [[https://qt4cg.org/dashboard/#pr-2129][#2129]]: 2099 Rename fn:jnode and jnode-type
+ PR [[https://qt4cg.org/dashboard/#pr-2117][#2117]]: 2082 parse-html options
+ PR [[https://qt4cg.org/dashboard/#pr-2115][#2115]]: 2084 - document order of axis steps when context value is a sequence
+ PR [[https://qt4cg.org/dashboard/#pr-2114][#2114]]: 2087 Change adaptive serialization of JNodes
+ PR [[https://qt4cg.org/dashboard/#pr-2113][#2113]]: 2102 Make type labels in diagram consistent

*** Close without action
:PROPERTIES:
:CUSTOM_ID: close-without-action
:END:

It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.

+ Issue [[https://github.com/qt4cg/qtspecs/issues/2086][#2086]]: Can the ¶value property of a JNode be (or contain) a JNode?
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1978][#1978]]: Function `map:build` does not allow expressing the dependency of a value on its key. Some simple types of maps cannot be built.
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1946][#1946]]: We need examples of a record with an entry that is a %method and invoking this method with the result it must produce
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1514][#1514]]: Editorial: optional position argument in function signature for for-each and other HOF 
+ Issue [[https://github.com/qt4cg/qtspecs/issues/1175][#1175]]: XPath: Optional parameters in the definition of an inline function
+ Issue [[https://github.com/qt4cg/qtspecs/issues/150][#150]]: fn:ranks: Produce all ranks in applying a function on the items of a sequence

*** Substantive PRs
:PROPERTIES:
:CUSTOM_ID: substantive
:END:

The following substantive PRs were open when this agenda was prepared.

+ PR [[https://qt4cg.org/dashboard/#pr-2116][#2116]]: 2112 Refine/revise the rules for get() in node tests
+ PR [[https://qt4cg.org/dashboard/#pr-2119][#2119]]: 2080 allow let $($head, $tail)
+ PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]: 2007 Revised design for xsl:array
+ PR [[https://qt4cg.org/dashboard/#pr-2130][#2130]]: Proposed new operator keywords: precedes, follows
+ PR [[https://qt4cg.org/dashboard/#pr-2123][#2123]]: 2051: XSLT group by cluster
+ PR [[https://qt4cg.org/dashboard/#pr-2019][#2019]]: 1776: XSLT template rules for maps and array
+ PR [[https://qt4cg.org/dashboard/#pr-2071][#2071]]: 77c deep update

* Technical agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** PR #2116: 2112 Refine/revise the rules for get() in node tests
:PROPERTIES:
:CUSTOM_ID: pr-2116
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2116][#2116]]
** PR #2119: 2080 allow let $($head, $tail)
:PROPERTIES:
:CUSTOM_ID: pr-2119
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2119][#2119]]
** PR #2120: 2007 Revised design for xsl:array
:PROPERTIES:
:CUSTOM_ID: pr-2120
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2120][#2120]]
** PR #2130: Proposed new operator keywords: precedes, follows
:PROPERTIES:
:CUSTOM_ID: pr-2130
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2130][#2130]]
** PR #2123: 2051: XSLT group by cluster
:PROPERTIES:
:CUSTOM_ID: pr-2123
:END:
See PR [[https://qt4cg.org/dashboard/#pr-2123][#2123]]

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:

