meeting/agenda/2025/07-29.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 131 Agenda 2025-07-29</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 131 Agenda 2025-07-29</h1>
<p>
<a href="../">Agenda index</a> / <a href="https://qt4cg.org">QT4CG.org</a> / <a href="https://qt4cg.org/dashboard">Dashboard</a> / <a href="https://github.com/qt4cg/qtspecs/issues">GH Issues</a> / <a href="https://github.com/qt4cg/qtspecs/pulls">GH Pull Requests</a>
</p>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00BST (15:00GMT, 17:00CEST, 11:00EDT).
</p>

<p>
The <a href="https://us06web.zoom.us/j/83199966275?pwd=SmN6V0RhUGdSTHFHZkd6cjgxVEY2QT09">Zoom meeting</a> ID is 831 9996 6275; the passcode is 707664.
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for more details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2025/07-22.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for <i>29 July 2025</i>. The CG <i>will not</i> meet on 5 August.
The following meeting is scheduled for 12 August 2025.
</p>

<p>
The CG will take a short recess in late August. We will <b>not</b> meet on 26 August,
2 September, or 9 September.
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/5]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-082-02: DN to work with NW to come to agreement on the fn:ranks proposal</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-116-01: Add a specific error code for unsupported options on doc and doc-available</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-118-01: MK to make an incorrect type raise an error in #1906</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-127-01: NW to diagram the JTree representing arbitrary XDM content.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-128-03: NW to compare the file: module against the equivalent XProc 3.1 steps</li>
</ul>
</div>
</div>

<div id="outline-container-open-pull-requests" class="outline-3">
<h3 id="open-pull-requests"><span class="section-number-3">1.6.</span> Review of open pull requests and issues</h3>
<div class="outline-text-3" id="text-open-pull-requests">
<p>
This section summarizes all of the issues and pull requests that need to be
resolved before we can finish. See <a href="#technical-agenda">Technical Agenda</a> below for the focus of this
meeting.
</p>
</div>

<div id="outline-container-blocked" class="outline-4">
<h4 id="blocked"><span class="section-number-4">1.6.1.</span> Blocked</h4>
<div class="outline-text-4" id="text-blocked">
<p>
The following PRs are open but have merge conflicts or comments which
suggest they aren’t ready for action.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2124">#2124</a>: 573 Functions to Construct Trees</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2063">#2063</a>: 1996 Lookups, KeySpecifier: Literal, ContextValueRef</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-1062">#1062</a>: 150bis revised proposal for fn:ranks</li>
</ul>
</div>
</div>

<div id="outline-container-merge-without-discussion" class="outline-4">
<h4 id="merge-without-discussion"><span class="section-number-4">1.6.2.</span> Merge without discussion</h4>
<div class="outline-text-4" id="text-merge-without-discussion">
<p>
The following PRs are editorial, small, or otherwise appeared to be
uncontroversial when the agenda was prepared. The chairs propose that
these can be merged without discussion. If you think discussion is
necessary, please say so.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2129">#2129</a>: 2099 Rename fn:jnode and jnode-type</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2117">#2117</a>: 2082 parse-html options</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2115">#2115</a>: 2084 - document order of axis steps when context value is a sequence</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2114">#2114</a>: 2087 Change adaptive serialization of JNodes</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2113">#2113</a>: 2102 Make type labels in diagram consistent</li>
</ul>
</div>
</div>

<div id="outline-container-close-without-action" class="outline-4">
<h4 id="close-without-action"><span class="section-number-4">1.6.3.</span> Close without action</h4>
<div class="outline-text-4" id="text-close-without-action">
<p>
It has been proposed that the following issues be closed without action.
If you think discussion is necessary, please say so.
</p>

<ul class="org-ul">
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/2086">#2086</a>: Can the ¶value property of a JNode be (or contain) a JNode?</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1978">#1978</a>: Function `map:build` does not allow expressing the dependency of a value on its key. Some simple types of maps cannot be built.</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1946">#1946</a>: We need examples of a record with an entry that is a %method and invoking this method with the result it must produce</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1514">#1514</a>: Editorial: optional position argument in function signature for for-each and other HOF</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/1175">#1175</a>: XPath: Optional parameters in the definition of an inline function</li>
<li>Issue <a href="https://github.com/qt4cg/qtspecs/issues/150">#150</a>: fn:ranks: Produce all ranks in applying a function on the items of a sequence</li>
</ul>
</div>
</div>

<div id="outline-container-substantive" class="outline-4">
<h4 id="substantive"><span class="section-number-4">1.6.4.</span> Substantive PRs</h4>
<div class="outline-text-4" id="text-substantive">
<p>
The following substantive PRs were open when this agenda was prepared.
</p>

<ul class="org-ul">
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2116">#2116</a>: 2112 Refine/revise the rules for get() in node tests</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2119">#2119</a>: 2080 allow let $($head, $tail)</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>: 2007 Revised design for xsl:array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2130">#2130</a>: Proposed new operator keywords: precedes, follows</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2123">#2123</a>: 2051: XSLT group by cluster</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2019">#2019</a>: 1776: XSLT template rules for maps and array</li>
<li>PR <a href="https://qt4cg.org/dashboard/#pr-2071">#2071</a>: 77c deep update</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-pr-2116" class="outline-3">
<h3 id="pr-2116"><span class="section-number-3">2.1.</span> PR #2116: 2112 Refine/revise the rules for get() in node tests</h3>
<div class="outline-text-3" id="text-pr-2116">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2116">#2116</a>
</p>
</div>
</div>
<div id="outline-container-pr-2119" class="outline-3">
<h3 id="pr-2119"><span class="section-number-3">2.2.</span> PR #2119: 2080 allow let $($head, $tail)</h3>
<div class="outline-text-3" id="text-pr-2119">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2119">#2119</a>
</p>
</div>
</div>
<div id="outline-container-pr-2120" class="outline-3">
<h3 id="pr-2120"><span class="section-number-3">2.3.</span> PR #2120: 2007 Revised design for xsl:array</h3>
<div class="outline-text-3" id="text-pr-2120">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2120">#2120</a>
</p>
</div>
</div>
<div id="outline-container-pr-2130" class="outline-3">
<h3 id="pr-2130"><span class="section-number-3">2.4.</span> PR #2130: Proposed new operator keywords: precedes, follows</h3>
<div class="outline-text-3" id="text-pr-2130">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2130">#2130</a>
</p>
</div>
</div>
<div id="outline-container-pr-2123" class="outline-3">
<h3 id="pr-2123"><span class="section-number-3">2.5.</span> PR #2123: 2051: XSLT group by cluster</h3>
<div class="outline-text-3" id="text-pr-2123">
<p>
See PR <a href="https://qt4cg.org/dashboard/#pr-2123">#2123</a>
</p>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
